Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/atdf/PIC32CX1025MTG128.atdf
        <register caption="Interrupt Status Register" name="ADC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="Receive Ready (cleared on read)" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Receive FIFO Empty (cleared on read)" mask="0x00000002" name="RXEMPTY"/>
          <bitfield caption="Receive FIFO Full (cleared on read)" mask="0x00000004" name="RXFULL"/>
          <bitfield caption="Receive FIFO Chunk (cleared on read)" mask="0x00000008" name="RXCHUNK"/>
          <bitfield caption="Receive Under Flow (cleared on read)" mask="0x00000010" name="RXUDR"/>
          <bitfield caption="Receive Over Flow (cleared on read)" mask="0x00000020" name="RXOVR"/>
          <bitfield caption="Supply Monitor Event (cleared on read)" mask="0x00000040" name="SMEV"/>
          <bitfield caption="End Of Sequence (cleared on read)" mask="0x00040000" name="EOS"/>
          <bitfield caption="Temperature Change (cleared on read)" mask="0x00080000" name="TEMPCHG"/>
          <bitfield caption="Data Ready (automatically set / cleared)" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error (cleared on read)" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event (cleared on read)" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR)" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR)" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="End Of Conversion Interrupt Enable Register" name="ADC_EOC_IER" offset="0x34" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Enable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Enable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Enable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Enable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Enable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Enable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Enable 7" mask="0x00000080" name="EOC7"/>
        </register>
        <register caption="End Of Conversion Interrupt Disable Register" name="ADC_EOC_IDR" offset="0x38" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Disable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Disable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Disable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Disable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Disable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Disable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Disable 7" mask="0x00000080" name="EOC7"/>
        </register>
        <register caption="End Of Conversion Interrupt Mask Register" name="ADC_EOC_IMR" offset="0x3C" rw="R" size="4">
          <bitfield caption="End of Conversion Interrupt Mask 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Mask 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Mask 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Mask 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Mask 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Mask 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Mask 7" mask="0x00000080" name="EOC7"/>
        </register>
        <register caption="End Of Conversion Interrupt Status Register" name="ADC_EOC_ISR" offset="0x40" rw="R" size="4">
          <bitfield caption="End of Conversion 0 (automatically set / cleared)" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion 1 (automatically set / cleared)" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion 2 (automatically set / cleared)" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion 3 (automatically set / cleared)" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion 4 (automatically set / cleared)" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion 5 (automatically set / cleared)" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion 6 (automatically set / cleared)" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion 7 (automatically set / cleared)" mask="0x00000080" name="EOC7"/>
        </register>
        <register caption="Temperature Sensor Mode Register" name="ADC_TEMPMR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Temperature Sensor On" mask="0x00000001" name="TEMPON"/>
          <bitfield caption="Temperature Comparison Mode" mask="0x00000030" name="TEMPCMPMOD" values="ADC_TEMPMR__TEMPCMPMOD"/>
        </register>
        <register caption="Temperature Compare Window Register" name="ADC_TEMPCWR" offset="0x48" rw="RW" size="4">
          <bitfield caption="Temperature Low Threshold" mask="0x00000FFF" name="TLOWTHRES"/>
          <bitfield caption="Temperature High Threshold" mask="0x0FFF0000" name="THIGHTHRES"/>
        </register>
        <register caption="Overrun Status Register" name="ADC_OVER" offset="0x4C" rw="R" size="4">
          <bitfield caption="Overrun Error 0" mask="0x00000001" name="OVRE0"/>
          <bitfield caption="Overrun Error 1" mask="0x00000002" name="OVRE1"/>
          <bitfield caption="Overrun Error 2" mask="0x00000004" name="OVRE2"/>
          <bitfield caption="Overrun Error 3" mask="0x00000008" name="OVRE3"/>
          <bitfield caption="Overrun Error 4" mask="0x00000010" name="OVRE4"/>
          <bitfield caption="Overrun Error 5" mask="0x00000020" name="OVRE5"/>
          <bitfield caption="Overrun Error 6" mask="0x00000040" name="OVRE6"/>
          <bitfield caption="Overrun Error 7" mask="0x00000080" name="OVRE7"/>
        </register>
