Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/atdf/PIC32CX1025MTG128.atdf
      <value-group caption="Write Protection Key" name="AES_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0." name="PASSWD" value="0x414553"/>
      </value-group>
      <value-group caption="Software Error Type (cleared on read)" name="AES_WPSR__SWETYP">
        <value caption="A write-only register has been read (Warning)." name="READ_WO" value="0x0"/>
        <value caption="AES is enabled and a write access has been performed on a read-only register (Warning)." name="WRITE_RO" value="0x1"/>
        <value caption="Access to an undefined address (Warning)." name="UNDEF_RW" value="0x2"/>
        <value caption="Abnormal use of AES_CR.START command when DMA access is configured." name="CTRL_START" value="0x3"/>
        <value caption="A key write, init value write, output data read, AES_MR and AES_EMR write, GCM configuration registers write, AES_BCNT write, Private Key bus access has been performed while a current processing is in progress (abnormal)." name="WEIRD_ACTION" value="0x4"/>
        <value caption="A tentative of start is required while the key is not fully loaded into the AES_KEYWRx registers." name="INCOMPLETE_KEY" value="0x5"/>
      </value-group>
      <value-group caption="Software Error Class (cleared on read)" name="AES_WPSR__ECLASS">
        <value caption="An abnormal access that does not affect system functionality" name="WARNING" value="0"/>
        <value caption="An access is performed into key, input data, control registers while the AES is performing an encryption/decryption or a start is request by software or DMA while the key is not fully configured." name="ERROR" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="AES_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
    </module>
    <module caption="Advanced Encryption Standard Bridge" name="AESB" id="11145" version="G">
      <register-group name="AESB">
        <register caption="Control Register" name="AESB_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
          <bitfield caption="Unlock Processing" mask="0x01000000" name="UNLOCK"/>
        </register>
        <register caption="Mode Register" name="AESB_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Processing Mode" mask="0x00000001" name="CIPHER"/>
          <bitfield caption="Automatic Bridge Mode" mask="0x00000004" name="AAHB"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000008" name="DUALBUFF" values="AESB_MR__DUALBUFF"/>
          <bitfield caption="Processing Delay" mask="0x000000F0" name="PROCDLY"/>
          <bitfield caption="Start Mode" mask="0x00000300" name="SMOD" values="AESB_MR__SMOD"/>
          <bitfield caption="Operating Mode" mask="0x00007000" name="OPMOD" values="AESB_MR__OPMOD"/>
          <bitfield caption="Last Output Data Mode" mask="0x00008000" name="LOD"/>
          <bitfield caption="Key" mask="0x00F00000" name="CKEY" values="AESB_MR__CKEY"/>
          <bitfield caption="Tamper Clear Enable" mask="0x80000000" name="TAMPCLR"/>
        </register>
        <register caption="Interrupt Enable Register" name="AESB_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
          <bitfield caption="Security and/or Safety Event" mask="0x00080000" name="SECE"/>
        </register>
        <register caption="Interrupt Disable Register" name="AESB_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
          <bitfield caption="Security and/or Safety Event" mask="0x00080000" name="SECE"/>
        </register>
        <register caption="Interrupt Mask Register" name="AESB_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
          <bitfield caption="Security and/or Safety Event" mask="0x00080000" name="SECE"/>
        </register>
        <register caption="Interrupt Status Register" name="AESB_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Status" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access" mask="0x0000F000" name="URAT" values="AESB_ISR__URAT"/>
          <bitfield caption="Security and/or Safety Event" mask="0x00080000" name="SECE"/>
        </register>
        <register caption="Key Word Register" name="AESB_KEYWR" offset="0x20" rw="W" size="4" count="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Input Data Register" name="AESB_IDATAR" offset="0x40" rw="W" size="4" count="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Output Data Register" name="AESB_ODATAR" offset="0x50" rw="R" size="4" count="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Initialization Vector Register" name="AESB_IVR" offset="0x60" rw="W" size="4" count="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
