Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/atdf/PIC32CX1025MTG128.atdf
        <register caption="TWI Interrupt Enable Register" name="FLEX_TWI_IER" offset="0x624" rw="W" size="4">
          <bitfield caption="Transmission Completed Interrupt Enable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Enable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Client Access Interrupt Enable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Enable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Enable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Enable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Enable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Client Access Interrupt Enable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Host Code Acknowledge Interrupt Enable" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Enable" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Enable" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Enable" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Enable" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="TWI Interrupt Disable Register" name="FLEX_TWI_IDR" offset="0x628" rw="W" size="4">
          <bitfield caption="Transmission Completed Interrupt Disable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Disable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Client Access Interrupt Disable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Disable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Disable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Disable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Disable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Client Access Interrupt Disable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Host Code Acknowledge Interrupt Disable" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Disable" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Disable" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Disable" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Disable" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="TWI Interrupt Mask Register" name="FLEX_TWI_IMR" offset="0x62C" rw="R" size="4">
          <bitfield caption="Transmission Completed Interrupt Mask" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Mask" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Mask" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Client Access Interrupt Mask" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Mask" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Mask" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Mask" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Mask" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Client Access Interrupt Mask" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Host Code Acknowledge Interrupt Mask" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Mask" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Mask" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Mask" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Mask" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="TWI Receive Holding Register" name="FLEX_TWI_RHR" offset="0x630" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_ENABLED"/>
          <bitfield caption="Host or Client Receive Holding Data" mask="0x000000FF" name="RXDATA" modes="DEFAULT"/>
          <bitfield caption="Start State (Client Sniffer Mode only)" mask="0x00000300" name="SSTATE" values="FLEX_TWI_RHR__SSTATE" modes="DEFAULT"/>
          <bitfield caption="Stop State (Client Sniffer Mode only)" mask="0x00000400" name="PSTATE" modes="DEFAULT"/>
          <bitfield caption="Acknowledge State (Client Sniffer Mode only)" mask="0x00001800" name="ASTATE" values="FLEX_TWI_RHR__ASTATE" modes="DEFAULT"/>
          <bitfield caption="Host or Client Receive Holding Data 0" mask="0x000000FF" name="RXDATA0" modes="FIFO_ENABLED"/>
          <bitfield caption="Host or Client Receive Holding Data 1" mask="0x0000FF00" name="RXDATA1" modes="FIFO_ENABLED"/>
          <bitfield caption="Host or Client Receive Holding Data 2" mask="0x00FF0000" name="RXDATA2" modes="FIFO_ENABLED"/>
          <bitfield caption="Host or Client Receive Holding Data 3" mask="0xFF000000" name="RXDATA3" modes="FIFO_ENABLED"/>
        </register>
        <register caption="TWI Transmit Holding Register" name="FLEX_TWI_THR" offset="0x634" rw="W" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_ENABLED"/>
          <bitfield caption="Host or Client Transmit Holding Data" mask="0x000000FF" name="TXDATA" modes="DEFAULT"/>
          <bitfield caption="Host or Client Transmit Holding Data 0" mask="0x000000FF" name="TXDATA0" modes="FIFO_ENABLED"/>
          <bitfield caption="Host or Client Transmit Holding Data 1" mask="0x0000FF00" name="TXDATA1" modes="FIFO_ENABLED"/>
          <bitfield caption="Host or Client Transmit Holding Data 2" mask="0x00FF0000" name="TXDATA2" modes="FIFO_ENABLED"/>
          <bitfield caption="Host or Client Transmit Holding Data 3" mask="0xFF000000" name="TXDATA3" modes="FIFO_ENABLED"/>
        </register>
        <register caption="TWI SMBus Timing Register" name="FLEX_TWI_SMBTR" offset="0x638" rw="RW" size="4">
          <bitfield caption="SMBus Clock Prescaler" mask="0x0000000F" name="PRESC"/>
          <bitfield caption="Client Clock Stretch Maximum Cycles" mask="0x0000FF00" name="TLOWS"/>
          <bitfield caption="Host Clock Stretch Maximum Cycles" mask="0x00FF0000" name="TLOWM"/>
          <bitfield caption="Clock High Maximum Cycles" mask="0xFF000000" name="THMAX"/>
        </register>
        <register caption="TWI High Speed Register" name="FLEX_TWI_HSR" offset="0x63C" rw="RW" size="4">
          <bitfield caption="TWI High Speed Host Code" mask="0x000000FF" name="MCODE"/>
        </register>
        <register caption="TWI Alternative Command Register" name="FLEX_TWI_ACR" offset="0x640" rw="RW" size="4">
          <bitfield caption="Data Length" mask="0x000000FF" name="DATAL"/>
          <bitfield caption="Transfer Direction" mask="0x00000100" name="DIR"/>
          <bitfield caption="PEC Request (SMBus Mode only)" mask="0x00000200" name="PEC"/>
          <bitfield caption="Next Data Length" mask="0x00FF0000" name="NDATAL"/>
          <bitfield caption="Next Transfer Direction" mask="0x01000000" name="NDIR"/>
          <bitfield caption="Next PEC Request (SMBus Mode only)" mask="0x02000000" name="NPEC"/>
        </register>
        <register caption="TWI Filter Register" name="FLEX_TWI_FILTR" offset="0x644" rw="RW" size="4">
          <bitfield caption="RX Digital Filter" mask="0x00000001" name="FILT"/>
          <bitfield caption="PAD Filter Enable" mask="0x00000002" name="PADFEN"/>
          <bitfield caption="Digital Filter Threshold" mask="0x00000700" name="THRES"/>
        </register>
        <register caption="TWI High Speed Clock Waveform Generator Register" name="FLEX_TWI_HSCWGR" offset="0x648" rw="RW" size="4">
          <bitfield caption="High Speed Clock Low Divider" mask="0x000000FF" name="HSCLDIV"/>
          <bitfield caption="High Speed Clock High Divider" mask="0x0000FF00" name="HSCHDIV"/>
          <bitfield caption="High Speed Clock Divider" mask="0x00070000" name="HSCKDIV"/>
        </register>
        <register caption="TWI Matching Register" name="FLEX_TWI_SWMR" offset="0x64C" rw="RW" size="4">
          <bitfield caption="Client Address 1" mask="0x0000007F" name="SADR1"/>
          <bitfield caption="Client Address 2" mask="0x00007F00" name="SADR2"/>
          <bitfield caption="Client Address 3" mask="0x007F0000" name="SADR3"/>
          <bitfield caption="Data Match" mask="0xFF000000" name="DATAM"/>
        </register>
        <register caption="TWI FIFO Mode Register" name="FLEX_TWI_FMR" offset="0x650" rw="RW" size="4">
          <bitfield caption="Transmitter Ready Mode" mask="0x00000003" name="TXRDYM" values="FLEX_TWI_FMR__TXRDYM"/>
          <bitfield caption="Receiver Ready Mode" mask="0x00000030" name="RXRDYM" values="FLEX_TWI_FMR__RXRDYM"/>
          <bitfield caption="Transmit FIFO Threshold" mask="0x003F0000" name="TXFTHRES"/>
          <bitfield caption="Receive FIFO Threshold" mask="0x3F000000" name="RXFTHRES"/>
        </register>
        <register caption="TWI FIFO Level Register" name="FLEX_TWI_FLR" offset="0x654" rw="R" size="4">
          <bitfield caption="Transmit FIFO Level" mask="0x0000003F" name="TXFL"/>
          <bitfield caption="Receive FIFO Level" mask="0x003F0000" name="RXFL"/>
        </register>
        <register caption="TWI FIFO Status Register" name="FLEX_TWI_FSR" offset="0x660" rw="R" size="4">
          <bitfield caption="Transmit FIFO Empty Flag (cleared on read)" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="Transmit FIFO Full Flag (cleared on read)" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="Transmit FIFO Threshold Flag (cleared on read)" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="Receive FIFO Empty Flag" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="Receive FIFO Full Flag" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="Receive FIFO Threshold Flag" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="Transmit FIFO Pointer Error Flag" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="Receive FIFO Pointer Error Flag" mask="0x00000080" name="RXFPTEF"/>
        </register>
