Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/atdf/PIC32CX1025MTG128.atdf
        <register caption="Status Register" name="ICM_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="ICM Enable Register" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Region Monitoring Disabled Raw Status" mask="0x00000F00" name="RAWRMDIS"/>
          <bitfield caption="Region Monitoring Disabled Status" mask="0x0000F000" name="RMDIS"/>
        </register>
        <register caption="Interrupt Enable Register" name="ICM_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Region Hash Completed Interrupt Enable" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch Interrupt Enable" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error Interrupt Enable" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition detected Interrupt Enable" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End bit Condition Detected Interrupt Enable" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Interrupt Disable" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Interrupt Enable" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Interrupt Disable Register" name="ICM_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Region Hash Completed Interrupt Disable" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch Interrupt Disable" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error Interrupt Disable" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition Detected Interrupt Disable" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End bit Condition detected Interrupt Disable" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Interrupt Disable" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Interrupt Disable" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Interrupt Mask Register" name="ICM_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Region Hash Completed Interrupt Mask" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch Interrupt Mask" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error Interrupt Mask" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition Detected Interrupt Mask" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End bit Condition Detected Interrupt Mask" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Interrupt Mask" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Interrupt Mask" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Interrupt Status Register" name="ICM_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Region Hash Completed" mask="0x0000000F" name="RHC"/>
          <bitfield caption="Region Digest Mismatch" mask="0x000000F0" name="RDM"/>
          <bitfield caption="Region Bus Error" mask="0x00000F00" name="RBE"/>
          <bitfield caption="Region Wrap Condition Detected" mask="0x0000F000" name="RWC"/>
          <bitfield caption="Region End Bit Condition Detected" mask="0x000F0000" name="REC"/>
          <bitfield caption="Region Status Updated Detected" mask="0x00F00000" name="RSU"/>
          <bitfield caption="Undefined Register Access Detection Status" mask="0x01000000" name="URAD"/>
        </register>
        <register caption="Undefined Access Status Register" name="ICM_UASR" offset="0x20" rw="R" size="4">
          <bitfield caption="Undefined Register Access Trace" mask="0x00000007" name="URAT" values="ICM_UASR__URAT"/>
        </register>
        <register caption="Region Descriptor Area Start Address Register" name="ICM_DSCR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Descriptor Area Start Address" mask="0xFFFFFFC0" name="DASA"/>
        </register>
        <register caption="Region Hash Area Start Address Register" name="ICM_HASH" offset="0x34" rw="RW" size="4">
          <bitfield caption="Hash Area Start Address" mask="0xFFFFFF00" name="HASA"/>
        </register>
        <register caption="User Initial Hash Value 0 Register" name="ICM_UIHVAL" offset="0x38" rw="W" size="4" count="16">
          <bitfield caption="Initial Hash Value" mask="0xFFFFFFFF" name="VAL"/>
        </register>
        <register caption="Write Protection Mode Register" name="ICM_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ICM_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ICM_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status (Cleared on read)" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="User SHA Algorithm" name="ICM_CFG__UALGO">
        <value caption="SHA1 algorithm processed" name="SHA1" value="0x0"/>
        <value caption="SHA256 algorithm processed" name="SHA256" value="0x1"/>
        <value caption="SHA384 algorithm processed" name="SHA384" value="0x2"/>
        <value caption="SHA512 algorithm processed" name="SHA512" value="0x3"/>
        <value caption="SHA224 algorithm processed" name="SHA224" value="0x4"/>
      </value-group>
      <value-group caption="Undefined Register Access Trace" name="ICM_UASR__URAT">
        <value caption="Unspecified structure member set to one detected when the descriptor is loaded." name="UNSPEC_STRUCT_MEMBER" value="0x0"/>
        <value caption="ICM_CFG modified during active monitoring." name="ICM_CFG_MODIFIED" value="0x1"/>
        <value caption="ICM_DSCR modified during active monitoring." name="ICM_DSCR_MODIFIED" value="0x2"/>
        <value caption="ICM_HASH modified during active monitoring" name="ICM_HASH_MODIFIED" value="0x3"/>
        <value caption="Write-only register read access" name="READ_ACCESS" value="0x4"/>
      </value-group>
