Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/atdf/PIC32CX1025MTG128.atdf
        <register caption="PIO Privilege Interrupt Status Register (p_iogroup = 0)" name="PIO_P_ISR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Input Change Interrupt Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Privilege Set I/O User Register (p_iogroup = 0)" name="PIO_P_SIO_UAR" offset="0x30" rw="W" size="4">
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000001" name="P0"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000002" name="P1"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000004" name="P2"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000008" name="P3"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000010" name="P4"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000020" name="P5"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000040" name="P6"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000080" name="P7"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000100" name="P8"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000200" name="P9"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000400" name="P10"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00000800" name="P11"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00001000" name="P12"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00002000" name="P13"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00004000" name="P14"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00008000" name="P15"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00010000" name="P16"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00020000" name="P17"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00040000" name="P18"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00080000" name="P19"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00100000" name="P20"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00200000" name="P21"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00400000" name="P22"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x00800000" name="P23"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x01000000" name="P24"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x02000000" name="P25"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x04000000" name="P26"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x08000000" name="P27"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x10000000" name="P28"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x20000000" name="P29"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x40000000" name="P30"/>
          <bitfield caption="Set I/O in User-Access mode" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Privilege Set I/O Privilege Register (p_iogroup = 0)" name="PIO_P_SIO_PAR" offset="0x34" rw="W" size="4">
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000001" name="P0"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000002" name="P1"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000004" name="P2"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000008" name="P3"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000010" name="P4"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000020" name="P5"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000040" name="P6"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000080" name="P7"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000100" name="P8"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000200" name="P9"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000400" name="P10"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00000800" name="P11"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00001000" name="P12"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00002000" name="P13"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00004000" name="P14"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00008000" name="P15"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00010000" name="P16"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00020000" name="P17"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00040000" name="P18"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00080000" name="P19"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00100000" name="P20"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00200000" name="P21"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00400000" name="P22"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x00800000" name="P23"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x01000000" name="P24"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x02000000" name="P25"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x04000000" name="P26"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x08000000" name="P27"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x10000000" name="P28"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x20000000" name="P29"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x40000000" name="P30"/>
          <bitfield caption="Set I/O in Privileged-Access mode" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Privilege I/O Security Status Register (p_iogroup = 0)" name="PIO_P_IOSSR" offset="0x38" rw="R" size="4">
          <bitfield caption="I/O Security Status" mask="0x00000001" name="P0" values="PIO_P_IOSSR0__P0"/>
          <bitfield caption="I/O Security Status" mask="0x00000002" name="P1" values="PIO_P_IOSSR0__P1"/>
          <bitfield caption="I/O Security Status" mask="0x00000004" name="P2" values="PIO_P_IOSSR0__P2"/>
          <bitfield caption="I/O Security Status" mask="0x00000008" name="P3" values="PIO_P_IOSSR0__P3"/>
          <bitfield caption="I/O Security Status" mask="0x00000010" name="P4" values="PIO_P_IOSSR0__P4"/>
          <bitfield caption="I/O Security Status" mask="0x00000020" name="P5" values="PIO_P_IOSSR0__P5"/>
          <bitfield caption="I/O Security Status" mask="0x00000040" name="P6" values="PIO_P_IOSSR0__P6"/>
          <bitfield caption="I/O Security Status" mask="0x00000080" name="P7" values="PIO_P_IOSSR0__P7"/>
          <bitfield caption="I/O Security Status" mask="0x00000100" name="P8" values="PIO_P_IOSSR0__P8"/>
          <bitfield caption="I/O Security Status" mask="0x00000200" name="P9" values="PIO_P_IOSSR0__P9"/>
          <bitfield caption="I/O Security Status" mask="0x00000400" name="P10" values="PIO_P_IOSSR0__P10"/>
          <bitfield caption="I/O Security Status" mask="0x00000800" name="P11" values="PIO_P_IOSSR0__P11"/>
          <bitfield caption="I/O Security Status" mask="0x00001000" name="P12" values="PIO_P_IOSSR0__P12"/>
          <bitfield caption="I/O Security Status" mask="0x00002000" name="P13" values="PIO_P_IOSSR0__P13"/>
          <bitfield caption="I/O Security Status" mask="0x00004000" name="P14" values="PIO_P_IOSSR0__P14"/>
          <bitfield caption="I/O Security Status" mask="0x00008000" name="P15" values="PIO_P_IOSSR0__P15"/>
          <bitfield caption="I/O Security Status" mask="0x00010000" name="P16" values="PIO_P_IOSSR0__P16"/>
          <bitfield caption="I/O Security Status" mask="0x00020000" name="P17" values="PIO_P_IOSSR0__P17"/>
          <bitfield caption="I/O Security Status" mask="0x00040000" name="P18" values="PIO_P_IOSSR0__P18"/>
          <bitfield caption="I/O Security Status" mask="0x00080000" name="P19" values="PIO_P_IOSSR0__P19"/>
          <bitfield caption="I/O Security Status" mask="0x00100000" name="P20" values="PIO_P_IOSSR0__P20"/>
          <bitfield caption="I/O Security Status" mask="0x00200000" name="P21" values="PIO_P_IOSSR0__P21"/>
          <bitfield caption="I/O Security Status" mask="0x00400000" name="P22" values="PIO_P_IOSSR0__P22"/>
          <bitfield caption="I/O Security Status" mask="0x00800000" name="P23" values="PIO_P_IOSSR0__P23"/>
          <bitfield caption="I/O Security Status" mask="0x01000000" name="P24" values="PIO_P_IOSSR0__P24"/>
          <bitfield caption="I/O Security Status" mask="0x02000000" name="P25" values="PIO_P_IOSSR0__P25"/>
          <bitfield caption="I/O Security Status" mask="0x04000000" name="P26" values="PIO_P_IOSSR0__P26"/>
          <bitfield caption="I/O Security Status" mask="0x08000000" name="P27" values="PIO_P_IOSSR0__P27"/>
          <bitfield caption="I/O Security Status" mask="0x10000000" name="P28" values="PIO_P_IOSSR0__P28"/>
          <bitfield caption="I/O Security Status" mask="0x20000000" name="P29" values="PIO_P_IOSSR0__P29"/>
          <bitfield caption="I/O Security Status" mask="0x40000000" name="P30" values="PIO_P_IOSSR0__P30"/>
          <bitfield caption="I/O Security Status" mask="0x80000000" name="P31" values="PIO_P_IOSSR0__P31"/>
        </register>
        <register caption="PIO Privilege I/O Freeze Configuration Register (p_iogroup = 0)" name="PIO_P_IOFR" offset="0x3C" rw="W" size="4">
          <bitfield caption="Freeze Physical Configuration" mask="0x00000001" name="FPHY"/>
          <bitfield caption="Freeze Interrupt Configuration" mask="0x00000002" name="FINT"/>
          <bitfield caption="Freeze Key" mask="0xFFFFFF00" name="FRZKEY" values="PIO_P_IOFR0__FRZKEY"/>
        </register>
      </register-group>
      <register-group name="PIO">
        <register-group name="PIO_GROUP" size="64" name-in-module="PIO_GROUP" offset="0x0" count="3"/>
        <register caption="PIO Write Protection Mode Register" name="PIO_WPMR" offset="0x5E0" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PIO_WPMR__WPKEY"/>
        </register>
        <register caption="PIO Write Protection Status Register" name="PIO_WPSR" offset="0x5E4" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
