Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/atdf/PIC32CX1025MTG128.atdf
        <register caption="Interrupt Mask Register" name="UART_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Mask RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Mask TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Mask End of Receive Transfer Interrupt" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Mask End of Transmit Interrupt" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Mask Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Mask Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Mask Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Mask Time-out Interrupt" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Mask TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Mask TXBUFE Interrupt" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Mask RXBUFF Interrupt" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Mask Comparison Interrupt" mask="0x00008000" name="CMP"/>
          <bitfield caption="Mask Analog Comparator Event Interrupt" mask="0x00010000" name="ACE"/>
        </register>
        <register caption="Interrupt Status Register" name="UART_SR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready (Cleared by reading the UART_RHR)" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (Cleared by writing the UART_THR)" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmitter Transfer" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error (Cleared by writing UART_CR.RSTSTA)" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error (Cleared by writing UART_CR.RSTSTA)" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error (Cleared by writing UART_CR.RSTSTA)" mask="0x00000080" name="PARE"/>
          <bitfield caption="Receiver Time-out (Cleared by writing the UART_CR.STTTO)" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (Cleared by writing the UART_THR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Transmission Buffer Empty" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Receive Buffer Full" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Comparison Match (Cleared by writing the UART_CR.RSTSTA)" mask="0x00008000" name="CMP"/>
          <bitfield caption="Analog Comparator Event Interrupt (Cleared by writing UART_CR.RSTSTA)" mask="0x00010000" name="ACE"/>
        </register>
        <register caption="Receive Holding Register" name="UART_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000000FF" name="RXCHR"/>
        </register>
        <register caption="Transmit Holding Register" name="UART_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" name="TXCHR"/>
        </register>
        <register caption="Baud Rate Generator Register" name="UART_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divisor" mask="0x0000FFFF" name="CD"/>
        </register>
        <register caption="Comparison Register" name="UART_CMPR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x000000FF" name="VAL1"/>
          <bitfield caption="Comparison Mode" mask="0x00001000" name="CMPMODE" values="UART_CMPR__CMPMODE"/>
          <bitfield caption="Compare Parity" mask="0x00004000" name="CMPPAR"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0x00FF0000" name="VAL2"/>
        </register>
        <register caption="Receiver Time-out Register" name="UART_RTOR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Time-out Value" mask="0x000000FF" name="TO"/>
        </register>
        <register caption="Current Status Register" name="UART_CSR" offset="0x002C" rw="R" size="4">
          <bitfield caption="Analog Comparator Output" mask="0x00000001" name="ACO"/>
        </register>
        <register caption="Write Protection Mode Register" name="UART_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="UART_WPMR__WPKEY"/>
        </register>
        <register caption="Receive Pointer Register" name="UART_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="UART_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="UART_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="UART_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="UART_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="UART_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="UART_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="UART_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="UART_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="UART_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
        <register caption="Write Protection Mode Register" name="UART_PWPMR" offset="0x128" rw="RW" size="4">
          <bitfield caption="Write Protection Pointer Registers Enable" mask="0x00000001" name="WPPTREN"/>
          <bitfield caption="Write Protection Counter Registers Enable" mask="0x00000002" name="WPCTREN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="UART_PWPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="UART Optical Interface Enable" name="UART_MR__OPT_EN">
        <value caption="Disables the UART optical link." name="DISABLED" value="0"/>
        <value caption="Enables the UART optical link." name="ENABLED" value="1"/>
      </value-group>
