Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/atdf/PIC32CX1025MTG128.atdf
        <register name="DCRSR" offset="0x4" rw="W" size="4" access-size="4" caption="Debug Core Register Selector Register">
          <bitfield name="REGSEL" caption="" mask="0x1F"/>
          <bitfield name="REGWnR" caption="" mask="0x10000"/>
        </register>
        <register name="DCRDR" offset="0x8" rw="RW" size="4" access-size="4" caption="Debug Core Register Data Register">
        </register>
        <register name="DEMCR" offset="0xC" rw="RW" size="4" access-size="4" caption="Debug Exception and Monitor Control Register">
          <bitfield name="VC_CORERESET" caption="" mask="0x1"/>
          <bitfield name="VC_MMERR" caption="" mask="0x10"/>
          <bitfield name="VC_NOCPERR" caption="" mask="0x20"/>
          <bitfield name="VC_CHKERR" caption="" mask="0x40"/>
          <bitfield name="VC_STATERR" caption="" mask="0x80"/>
          <bitfield name="VC_BUSERR" caption="" mask="0x100"/>
          <bitfield name="VC_INTERR" caption="" mask="0x200"/>
          <bitfield name="VC_HARDERR" caption="" mask="0x400"/>
          <bitfield name="MON_EN" caption="" mask="0x10000"/>
          <bitfield name="MON_PEND" caption="" mask="0x20000"/>
          <bitfield name="MON_STEP" caption="" mask="0x40000"/>
          <bitfield name="MON_REQ" caption="" mask="0x80000"/>
          <bitfield name="TRCENA" caption="" mask="0x1000000"/>
        </register>
      </register-group>
    </module>
    <module name="DWT" version="1.0.0" caption="Data Watchpoint and Trace Register">
      <register-group name="DWT" caption="Data Watchpoint and Trace Register">
        <register name="CTRL" offset="0x0" rw="RW" size="4" access-size="4" caption="Control Register">
          <bitfield name="CYCCNTENA" caption="" mask="0x1"/>
          <bitfield name="POSTPRESET" caption="" mask="0x1E"/>
          <bitfield name="POSTINIT" caption="" mask="0x1E0"/>
          <bitfield name="CYCTAP" caption="" mask="0x200"/>
          <bitfield name="SYNCTAP" caption="" mask="0xC00"/>
          <bitfield name="PCSAMPLENA" caption="" mask="0x1000"/>
          <bitfield name="EXCTRCENA" caption="" mask="0x10000"/>
          <bitfield name="CPIEVTENA" caption="" mask="0x20000"/>
          <bitfield name="EXCEVTENA" caption="" mask="0x40000"/>
          <bitfield name="SLEEPEVTENA" caption="" mask="0x80000"/>
          <bitfield name="LSUEVTENA" caption="" mask="0x100000"/>
          <bitfield name="FOLDEVTENA" caption="" mask="0x200000"/>
          <bitfield name="CYCEVTENA" caption="" mask="0x400000"/>
          <bitfield name="NOPRFCNT" caption="" mask="0x1000000"/>
          <bitfield name="NOCYCCNT" caption="" mask="0x2000000"/>
          <bitfield name="NOEXTTRIG" caption="" mask="0x4000000"/>
          <bitfield name="NOTRCPKT" caption="" mask="0x8000000"/>
          <bitfield name="NUMCOMP" caption="" mask="0xF0000000"/>
        </register>
        <register name="CYCCNT" offset="0x4" rw="RW" size="4" access-size="4" caption="Cycle Count Register">
        </register>
        <register name="CPICNT" offset="0x8" rw="RW" size="4" access-size="4" caption="CPI Count Register">
          <bitfield name="CPICNT" caption="" mask="0xFF"/>
        </register>
        <register name="EXCCNT" offset="0xC" rw="RW" size="4" access-size="4" caption="Exception Overhead Count Register">
          <bitfield name="EXCCNT" caption="" mask="0xFF"/>
        </register>
        <register name="SLEEPCNT" offset="0x10" rw="RW" size="4" access-size="4" caption="Sleep Count Register">
          <bitfield name="SLEEPCNT" caption="" mask="0xFF"/>
        </register>
        <register name="LSUCNT" offset="0x14" rw="RW" size="4" access-size="4" caption="LSU Count Register">
          <bitfield name="LSUCNT" caption="" mask="0xFF"/>
        </register>
        <register name="FOLDCNT" offset="0x18" rw="RW" size="4" access-size="4" caption="Folded-instruction Count Register">
          <bitfield name="FOLDCNT" caption="" mask="0xFF"/>
        </register>
        <register name="PCSR" offset="0x1C" rw="R" size="4" access-size="4" caption="Program Counter Sample Register">
        </register>
        <register name="COMP0" offset="0x20" rw="RW" size="4" access-size="4" caption="Comparator Register 0">
        </register>
        <register name="MASK0" offset="0x24" rw="RW" size="4" access-size="4" caption="Mask Register 0">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
        <register name="FUNCTION0" offset="0x28" rw="RW" size="4" access-size="4" caption="Function Register 0">
          <bitfield name="FUNCTION" caption="" mask="0xF"/>
          <bitfield name="EMITRANGE" caption="" mask="0x20"/>
          <bitfield name="CYCMATCH" caption="" mask="0x80"/>
          <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
          <bitfield name="LNK1ENA" caption="" mask="0x200"/>
          <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
          <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
          <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
          <bitfield name="MATCHED" caption="" mask="0x1000000"/>
        </register>
        <register name="COMP1" offset="0x30" rw="RW" size="4" access-size="4" caption="Comparator Register 1">
        </register>
        <register name="MASK1" offset="0x34" rw="RW" size="4" access-size="4" caption="Mask Register 1">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
        <register name="FUNCTION1" offset="0x38" rw="RW" size="4" access-size="4" caption="Function Register 1">
          <bitfield name="FUNCTION" caption="" mask="0xF"/>
          <bitfield name="EMITRANGE" caption="" mask="0x20"/>
          <bitfield name="CYCMATCH" caption="" mask="0x80"/>
          <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
          <bitfield name="LNK1ENA" caption="" mask="0x200"/>
          <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
          <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
          <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
          <bitfield name="MATCHED" caption="" mask="0x1000000"/>
        </register>
        <register name="COMP2" offset="0x40" rw="RW" size="4" access-size="4" caption="Comparator Register 2">
        </register>
